data_generation/simulation_results/of/case_58/constant/simParams
nIter 2000;
hComponent0 1207.4015453239836;
hComponent1 1327.5670272173725;
hComponent2 671.953823333107;
hComponent3 625.1132264243021;
hComponent4 915.0370842341742;kComponent0 59.64562589444387;
kComponent1 45.52833787377521;
kComponent2 37.137882245485635;
kComponent3 41.92614914233842;
kComponent4 32.792390891321645;
tAmbient 300;
Ux 1.4868842098455068;
kPCB 0.18295939005654577;